[
    {
        "type": "game",
        "title": "Hit the Goal",
        "description": "it is a unique twist on the classic bubble shooter genre. In this 2D mobile game, player control a football at the bottom of the screen, aiming to launch it accurately towards a central circular goal while navigating a dynamic field of rotating and animated lines.",
        "tags": [
            "Godot",
            "GDscript"
        ],
        "videos": ["htg.mp4"],
        "images": ["htg-img1.jpg", "htg-img2.jpg"],
        "github": "https://github.com/surendra019/hit-the-goal-android-game",
        "status": "complete"
        
    },
    {
        "type": "game",
        "title": "Celestial Clash",
        "description": "Celestial Clash is a thrilling 2D spaceship shooter where you battle waves of alien spacecraft. Pilot your advanced spaceship through intense space combat, using powerful abilities like multiple bullets, rapid-fire, and shields to outmaneuver your enemies. ",
        "tags": [
          "Godot",
          "GDscript"
        ],
        "videos": [
          "cc.mp4"
        ],
        "images": [
          "cc-img1.jpg",
          "cc-img2.jpg",
          "cc-img3.jpg"
        ],
        "github": "https://github.com/surendra019/celestial-clash-android-game",
        "status": "complete"
      },
      {
        "type": "game",
        "title": "Clash of KG",
        "description": "It is a strategy-based game inspired by Fire Emblem, offering an engaging offline mode where two teams, each with up to four characters, battle it out. With 11 unique characters and 6 elemental types, every character boasts distinct abilities and elemental weaknesses, adding depth to the gameplay. Movement is strategic, as characters navigate a grid-based battlefield with movement and attack ranges defined by their abilities. it challenges players to think critically and plan their moves to outsmart the opposing team and emerge victorious.",
        "tags": [
          "Godot",
          "GDscript"
        ],
        "videos": [
          "cokg.mp4"
        ],
        "images": [
          "cokg-img1.jpg",
          "cokg-img2.jpg",
          "cokg-img3.jpg",
          "cokg-img4.jpg"
        ],
        "status": "complete",
        "github": "https://github.com/surendra019/clash-of-kg-android-game"
      },
      {
        "type": "game",
        "title": "Mindease",
        "description": "It is a relaxing game designed to soothe your mind with three calming mini-games. Unwind with the coloring game, where you can fill in shapes with colors of your choice. Challenge your creativity with the puzzle game by connecting pieces to reveal beautiful images. Finally, enjoy the tactile experience of the sand game, where you remove sand to create shapes and arrange objects on the sand. It offers a peaceful escape, allowing you to de-stress and immerse yourself in soothing, enjoyable activities.",
        "tags": [
          "Godot",
          "GDscript"
        ],
        "videos": [
          "me.mp4"
        ],
        "images": [
          "me-img1.jpg",
          "me-img2.jpg",
          "me-img3.jpg"
        ],
        "status": "complete"
      },
      {
        "type": "app",
        "title": "iTorch",
        "description": "Illuminate your surroundings with ease using our Torch app, developed with the powerful Godot engine and enhanced with a custom Android plugin. Whether you're searching for something in the dark, need a reliable light source on the go, or just want a quick way to brighten up your day, our Torch app is here to help.",
        "tags": [
          "Godot",
          "GDscript",
          "Java"
        ],
        "videos": [],
        "images": [
          "torch-img1.jpg",
          "torch-img2.jpg"
        ],
        "status": "complete",
        "github": "https://github.com/surendra019/TorchApp"
      }
]